name: "LeNet"
layer {
  name: "mnist"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TRAIN
  }
  transform_param {
    scale: 0.00390625
  }
  data_param {
    source: "examples/mnist/mnist_train_mlp_lmdb"
    batch_size: 64
    backend: LMDB
  }
}
layer {
  name: "mnist"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TEST
  }
  transform_param {
    scale: 0.00390625
  }
  data_param {
    source: "examples/mnist/mnist_test_mlp_lmdb"
    batch_size: 100
    backend: LMDB
  }
}

layer {
  name: "ip1"
  type: "InnerProduct"
  bottom: "data"
  top: "ip1"
  param {
    lr_mult: 1
    quantification_level: -0.1
    quantification_level: 0
    quantification_level: 0.1
    quantification_level: 0.07
    quantification_level: -0.07
#    quantification_level: 0.03
#    quantification_level: -0.03
#    quantification_level: 0.05
#    quantification_level: -0.05
#    quantification_level: -0.06
#    quantification_level: 0
#    quantification_level: 0.06

  }
  param {
    lr_mult: 2
  }
  inner_product_param {
    num_output: 500
    weight_filler {
      type: "msra"
      #min:-1
      #max:1
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu1"
  type: "ReLU"
  bottom: "ip1"
  top: "ip1"

}
layer {
  name: "ip2"
  type: "InnerProduct"
  bottom: "ip1"
  top: "ip2"
  param {
    lr_mult: 1
   quantification_level: -0.03
   quantification_level: 0
   quantification_level: 0.03
   quantification_level: 0.09
   quantification_level: -0.09
#   quantification_level: -0.05
#   quantification_level: 0.05
#   quantification_level: -0.1
#   quantification_level: 0.1
#   quantification_level: -0.06
#   quantification_level: 0
#   quantification_level: 0.06
  }
  param {
    lr_mult: 2
  }
  inner_product_param {
    num_output: 300
    weight_filler {
      type: "msra"
      #min:-1
      #max:1
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu2"
  type: "ReLU"
  bottom: "ip2"
  top: "ip2"
}
layer {
  name: "ip3"
  type: "InnerProduct"
  bottom: "ip2"
  top: "ip3"
  param {
    lr_mult: 1
    decay_mult: 4
    quantification_level: -0.25
    quantification_level: -0
    quantification_level: 0.25
    quantification_level: -0.31
    quantification_level: 0.31
#    quantification_level: 0.59
#    quantification_level: -0.59
#    quantification_level: 0.61
#    quantification_level: -0.61
#    quantification_level: -0.06
#    quantification_level: 0
#    quantification_level: 0.06
  }
  param {
    lr_mult: 2
  }
  inner_product_param {
    num_output: 10
    weight_filler {
      type: "msra"
      #min:-0.05
      #max:0.05
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "accuracy"
  type: "Accuracy"
  bottom: "ip3"
  bottom: "label"
  top: "accuracy"
  include {
    phase: TEST
  }
}
layer {
  name: "loss"
  type: "SoftmaxWithLoss"
  bottom: "ip3"
  bottom: "label"
  top: "loss"
}
